app/helpers/application_helper.rb

  def current_user
    if session[:user_id]
      @user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]