app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def current_user
    if session[:user_id]
      @user = User.find_by(id: session[:user_id])