app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
    if params[:q]
        @cats_atts = Cat.select{|c| c.attributes.values.any?{|v| v.to_s.downcase.include?(params[:q].downcase)}}
        @cats_owner = Cat.select{|c| c.owner.name.downcase.include?(params[:q].downcase)}
        @cats = @cats_owner + @cats_atts
      else
      @cats = Cat.all

SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "fuzzy"], ["LIMIT", 1]]
SELECT "cats".* FROM "cats"
SELECT "tags".* FROM "tags" INNER JOIN "cat_tags" ON "tags"."id" = "cat_tags"."tag_id" WHERE "cat_tags"."cat_id" = ?  [["cat_id", 1]]
SELECT 1 AS one FROM "tags" INNER JOIN "cat_tags" ON "tags"."id" = "cat_tags"."tag_id" WHERE "cat_tags"."cat_id" = ? AND "tags"."id" = ? LIMIT ?  [["cat_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def tagsearch
    @tag = Tag.find_by(name: params[:tag])
    @cats = Cat.select{|c| c.tags.include?(@tag)}

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
    @cat = Cat.find(params[:id])

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_cat
    @cat = Cat.find(params[:id])