app/models/cat.rb

    def reviews #all reviews for cat. Returns hash w/ reviewer, review, rating
        reviews = Review.select{|r| r.reservation.cat == self}
        reviews.map{|r| {reviewer: r.reservation.renter, review: r.renter_review, rating: r.renter_rating}}
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews"
SELECT "cat_reviews".* FROM "cat_reviews" WHERE "cat_reviews"."reservation_id" = ? LIMIT ?  [["reservation_id", 1], ["LIMIT", 1]]

    def self.most_popular #returns 3 most popular by reservation count
        all.sort_by{|cat| cat.reservations.count}.reverse[0..2]
---
SELECT "cats".* FROM "cats"
SELECT "reservations".* FROM "reservations" WHERE "reservations"."cat_id" = ?  [["cat_id", 1]]