app/views/cats/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "cat_tags" ON "tags"."id" = "cat_tags"."tag_id" WHERE "cat_tags"."cat_id" = ?  [["cat_id", 1]]
---
  <p>Tags:
  <%cat.tags[0..2].each do |tag|%>