app/views/cats/show.html.erb

SELECT "reviews".* FROM "reviews"
---
  <h3>Reviews of <%= @cat.name %></h3>
  <% if !@cat.reviews.empty? %>